grevaillot/svd_tools/headers/STM32L4x6/rcc.h
/** RCC_CICR_HSI48RDYC HSI48 oscillator ready interrupt clear **/
#define RCC_CICR_HSI48RDYC		(1 << 10)
/** RCC_CICR_LSECSSC LSE Clock security system interrupt clear **/
#define RCC_CICR_LSECSSC		(1 << 9)
/** RCC_CICR_CSSC Clock security system interrupt clear **/
#define RCC_CICR_CSSC		(1 << 8)
/** RCC_CICR_PLLSAI2RDYC PLLSAI2 ready interrupt clear **/
#define RCC_CICR_PLLSAI2RDYC		(1 << 7)
/** RCC_CICR_PLLSAI1RDYC PLLSAI1 ready interrupt clear **/
#define RCC_CICR_PLLSAI1RDYC		(1 << 6)
/** RCC_CICR_PLLRDYC PLL ready interrupt clear **/
#define RCC_CICR_PLLRDYC		(1 << 5)
/** RCC_CICR_HSERDYC HSE ready interrupt clear **/
#define RCC_CICR_HSERDYC		(1 << 4)
/** RCC_CICR_HSIRDYC HSI ready interrupt clear **/
#define RCC_CICR_HSIRDYC		(1 << 3)
/** RCC_CICR_MSIRDYC MSI ready interrupt clear **/
#define RCC_CICR_MSIRDYC		(1 << 2)
/** RCC_CICR_LSERDYC LSE ready interrupt clear **/
#define RCC_CICR_LSERDYC		(1 << 1)
/** RCC_CICR_LSIRDYC LSI ready interrupt clear **/
#define RCC_CICR_LSIRDYC		(1 << 0)

/**@}*/

/** @defgroup rcc_ahb1rstr AHB1RSTR AHB1 peripheral reset register
@{*/

/** RCC_AHB1RSTR_DMA2DRST DMA2D reset **/
#define RCC_AHB1RSTR_DMA2DRST		(1 << 17)
/** RCC_AHB1RSTR_TSCRST Touch Sensing Controller reset **/
#define RCC_AHB1RSTR_TSCRST		(1 << 16)
/** RCC_AHB1RSTR_CRCRST CRC reset **/
#define RCC_AHB1RSTR_CRCRST		(1 << 12)
/** RCC_AHB1RSTR_FLASHRST Flash memory interface reset **/
#define RCC_AHB1RSTR_FLASHRST		(1 << 8)
/** RCC_AHB1RSTR_DMA2RST DMA2 reset **/
#define RCC_AHB1RSTR_DMA2RST		(1 << 1)
/** RCC_AHB1RSTR_DMA1RST DMA1 reset **/
#define RCC_AHB1RSTR_DMA1RST		(1 << 0)

/**@}*/

/** @defgroup rcc_ahb2rstr AHB2RSTR AHB2 peripheral reset register
@{*/

/** RCC_AHB2RSTR_RNGRST Random number generator reset **/
#define RCC_AHB2RSTR_RNGRST		(1 << 18)
/** RCC_AHB2RSTR_HASH1RST Hash reset **/
#define RCC_AHB2RSTR_HASH1RST		(1 << 17)
/** RCC_AHB2RSTR_AESRST AES hardware accelerator reset **/
#define RCC_AHB2RSTR_AESRST		(1 << 16)
/** RCC_AHB2RSTR_DCMIRST Digital Camera Interface reset **/
#define RCC_AHB2RSTR_DCMIRST		(1 << 14)
/** RCC_AHB2RSTR_ADCRST ADC reset **/
#define RCC_AHB2RSTR_ADCRST		(1 << 13)
/** RCC_AHB2RSTR_OTGFSRST USB OTG FS reset **/
#define RCC_AHB2RSTR_OTGFSRST		(1 << 12)
/** RCC_AHB2RSTR_GPIOIRST IO port I reset **/
#define RCC_AHB2RSTR_GPIOIRST		(1 << 8)
/** RCC_AHB2RSTR_GPIOHRST IO port H reset **/
#define RCC_AHB2RSTR_GPIOHRST		(1 << 7)
/** RCC_AHB2RSTR_GPIOGRST IO port G reset **/
#define RCC_AHB2RSTR_GPIOGRST		(1 << 6)
/** RCC_AHB2RSTR_GPIOFRST IO port F reset **/
#define RCC_AHB2RSTR_GPIOFRST		(1 << 5)
/** RCC_AHB2RSTR_GPIOERST IO port E reset **/
#define RCC_AHB2RSTR_GPIOERST		(1 << 4)
/** RCC_AHB2RSTR_GPIODRST IO port D reset **/
#define RCC_AHB2RSTR_GPIODRST		(1 << 3)
/** RCC_AHB2RSTR_GPIOCRST IO port C reset **/
#define RCC_AHB2RSTR_GPIOCRST		(1 << 2)
/** RCC_AHB2RSTR_GPIOBRST IO port B reset **/
#define RCC_AHB2RSTR_GPIOBRST		(1 << 1)
/** RCC_AHB2RSTR_GPIOARST IO port A reset **/
#define RCC_AHB2RSTR_GPIOARST		(1 << 0)

/**@}*/

/** @defgroup rcc_ahb3rstr AHB3RSTR AHB3 peripheral reset register
@{*/

/** RCC_AHB3RSTR_QSPIRST Quad SPI memory interface reset **/
#define RCC_AHB3RSTR_QSPIRST		(1 << 8)
/** RCC_AHB3RSTR_FMCRST Flexible memory controller reset **/
#define RCC_AHB3RSTR_FMCRST		(1 << 0)

/**@}*/

/** @defgroup rcc_apb1rstr1 APB1RSTR1 APB1 peripheral reset register 1
@{*/

/** RCC_APB1RSTR1_LPTIM1RST Low Power Timer 1 reset **/
#define RCC_APB1RSTR1_LPTIM1RST		(1 << 31)
/** RCC_APB1RSTR1_OPAMPRST OPAMP interface reset **/
#define RCC_APB1RSTR1_OPAMPRST		(1 << 30)
/** RCC_APB1RSTR1_DAC1RST DAC1 interface reset **/
#define RCC_APB1RSTR1_DAC1RST		(1 << 29)
/** RCC_APB1RSTR1_PWRRST Power interface reset **/
#define RCC_APB1RSTR1_PWRRST		(1 << 28)
/** RCC_APB1RSTR1_CAN2RST CAN2 reset **/
#define RCC_APB1RSTR1_CAN2RST		(1 << 26)
/** RCC_APB1RSTR1_CAN1RST CAN1 reset **/
#define RCC_APB1RSTR1_CAN1RST		(1 << 25)
/** RCC_APB1RSTR1_CRSRST CRS reset **/
#define RCC_APB1RSTR1_CRSRST		(1 << 24)
/** RCC_APB1RSTR1_I2C3RST I2C3 reset **/
#define RCC_APB1RSTR1_I2C3RST		(1 << 23)
/** RCC_APB1RSTR1_I2C2RST I2C2 reset **/
#define RCC_APB1RSTR1_I2C2RST		(1 << 22)
/** RCC_APB1RSTR1_I2C1RST I2C1 reset **/
#define RCC_APB1RSTR1_I2C1RST		(1 << 21)
/** RCC_APB1RSTR1_UART5RST UART5 reset **/
#define RCC_APB1RSTR1_UART5RST		(1 << 20)
/** RCC_APB1RSTR1_UART4RST UART4 reset **/
#define RCC_APB1RSTR1_UART4RST		(1 << 19)
/** RCC_APB1RSTR1_USART3RST USART3 reset **/
#define RCC_APB1RSTR1_USART3RST		(1 << 18)
/** RCC_APB1RSTR1_USART2RST USART2 reset **/
#define RCC_APB1RSTR1_USART2RST		(1 << 17)
/** RCC_APB1RSTR1_SPI3RST SPI3 reset **/
#define RCC_APB1RSTR1_SPI3RST		(1 << 15)
/** RCC_APB1RSTR1_SPI2RST SPI2 reset **/
#define RCC_APB1RSTR1_SPI2RST		(1 << 14)
/** RCC_APB1RSTR1_LCDRST LCD interface reset **/
#define RCC_APB1RSTR1_LCDRST		(1 << 9)
/** RCC_APB1RSTR1_TIM7RST TIM7 timer reset **/
#define RCC_APB1RSTR1_TIM7RST		(1 << 5)
/** RCC_APB1RSTR1_TIM6RST TIM6 timer reset **/
#define RCC_APB1RSTR1_TIM6RST		(1 << 4)
/** RCC_APB1RSTR1_TIM5RST TIM5 timer reset **/
#define RCC_APB1RSTR1_TIM5RST		(1 << 3)
/** RCC_APB1RSTR1_TIM4RST TIM3 timer reset **/
#define RCC_APB1RSTR1_TIM4RST		(1 << 2)
/** RCC_APB1RSTR1_TIM3RST TIM3 timer reset **/
#define RCC_APB1RSTR1_TIM3RST		(1 << 1)
/** RCC_APB1RSTR1_TIM2RST TIM2 timer reset **/
#define RCC_APB1RSTR1_TIM2RST		(1 << 0)

/**@}*/

/** @defgroup rcc_apb1rstr2 APB1RSTR2 APB1 peripheral reset register 2
@{*/

/** RCC_APB1RSTR2_LPTIM2RST Low-power timer 2 reset **/
#define RCC_APB1RSTR2_LPTIM2RST		(1 << 5)
/** RCC_APB1RSTR2_SWPMI1RST Single wire protocol reset **/
#define RCC_APB1RSTR2_SWPMI1RST		(1 << 2)
/** RCC_APB1RSTR2_I2C4RST I2C4 reset **/
#define RCC_APB1RSTR2_I2C4RST		(1 << 1)
/** RCC_APB1RSTR2_LPUART1RST Low-power UART 1 reset **/
#define RCC_APB1RSTR2_LPUART1RST		(1 << 0)

/**@}*/

/** @defgroup rcc_apb2rstr APB2RSTR APB2 peripheral reset register
@{*/

/** RCC_APB2RSTR_DFSDMRST Digital filters for sigma-delata modulators (DFSDM) reset **/
#define RCC_APB2RSTR_DFSDMRST		(1 << 24)
/** RCC_APB2RSTR_SAI2RST Serial audio interface 2 (SAI2) reset **/
#define RCC_APB2RSTR_SAI2RST		(1 << 22)
/** RCC_APB2RSTR_SAI1RST Serial audio interface 1 (SAI1) reset **/
#define RCC_APB2RSTR_SAI1RST		(1 << 21)
/** RCC_APB2RSTR_TIM17RST TIM17 timer reset **/
#define RCC_APB2RSTR_TIM17RST		(1 << 18)
/** RCC_APB2RSTR_TIM16RST TIM16 timer reset **/
#define RCC_APB2RSTR_TIM16RST		(1 << 17)
/** RCC_APB2RSTR_TIM15RST TIM15 timer reset **/
#define RCC_APB2RSTR_TIM15RST		(1 << 16)
/** RCC_APB2RSTR_USART1RST USART1 reset **/
#define RCC_APB2RSTR_USART1RST		(1 << 14)
/** RCC_APB2RSTR_TIM8RST TIM8 timer reset **/
#define RCC_APB2RSTR_TIM8RST		(1 << 13)
/** RCC_APB2RSTR_SPI1RST SPI1 reset **/
#define RCC_APB2RSTR_SPI1RST		(1 << 12)
/** RCC_APB2RSTR_TIM1RST TIM1 timer reset **/
#define RCC_APB2RSTR_TIM1RST		(1 << 11)
/** RCC_APB2RSTR_SDMMCRST SDMMC reset **/
#define RCC_APB2RSTR_SDMMCRST		(1 << 10)
/** RCC_APB2RSTR_SYSCFGRST System configuration (SYSCFG) reset **/
#define RCC_APB2RSTR_SYSCFGRST		(1 << 0)

/**@}*/

/** @defgroup rcc_ahb1enr AHB1ENR AHB1 peripheral clock enable register
@{*/

/** RCC_AHB1ENR_DMA2DEN DMA2D clock enable **/
#define RCC_AHB1ENR_DMA2DEN		(1 << 17)
/** RCC_AHB1ENR_TSCEN Touch Sensing Controller clock enable **/
#define RCC_AHB1ENR_TSCEN		(1 << 16)
/** RCC_AHB1ENR_CRCEN CRC clock enable **/
#define RCC_AHB1ENR_CRCEN		(1 << 12)
/** RCC_AHB1ENR_FLASHEN Flash memory interface clock enable **/
#define RCC_AHB1ENR_FLASHEN		(1 << 8)
/** RCC_AHB1ENR_DMA2EN DMA2 clock enable **/
#define RCC_AHB1ENR_DMA2EN		(1 << 1)
/** RCC_AHB1ENR_DMA1EN DMA1 clock enable **/
#define RCC_AHB1ENR_DMA1EN		(1 << 0)

/**@}*/

