grevaillot/svd_tools/headers/STM32L4x6/rcc.h
/** @defgroup rcc_ahb2enr AHB2ENR AHB2 peripheral clock enable register
@{*/

/** RCC_AHB2ENR_RNGEN Random Number Generator clock enable **/
#define RCC_AHB2ENR_RNGEN		(1 << 18)
/** RCC_AHB2ENR_HASH1EN HASH clock enable **/
#define RCC_AHB2ENR_HASH1EN		(1 << 17)
/** RCC_AHB2ENR_AESEN AES accelerator clock enable **/
#define RCC_AHB2ENR_AESEN		(1 << 16)
/** RCC_AHB2ENR_DCMIEN DCMI clock enable **/
#define RCC_AHB2ENR_DCMIEN		(1 << 14)
/** RCC_AHB2ENR_ADCEN ADC clock enable **/
#define RCC_AHB2ENR_ADCEN		(1 << 13)
/** RCC_AHB2ENR_OTGFSEN OTG full speed clock enable **/
#define RCC_AHB2ENR_OTGFSEN		(1 << 12)
/** RCC_AHB2ENR_GPIOIEN IO port I clock enable **/
#define RCC_AHB2ENR_GPIOIEN		(1 << 8)
/** RCC_AHB2ENR_GPIOHEN IO port H clock enable **/
#define RCC_AHB2ENR_GPIOHEN		(1 << 7)
/** RCC_AHB2ENR_GPIOGEN IO port G clock enable **/
#define RCC_AHB2ENR_GPIOGEN		(1 << 6)
/** RCC_AHB2ENR_GPIOFEN IO port F clock enable **/
#define RCC_AHB2ENR_GPIOFEN		(1 << 5)
/** RCC_AHB2ENR_GPIOEEN IO port E clock enable **/
#define RCC_AHB2ENR_GPIOEEN		(1 << 4)
/** RCC_AHB2ENR_GPIODEN IO port D clock enable **/
#define RCC_AHB2ENR_GPIODEN		(1 << 3)
/** RCC_AHB2ENR_GPIOCEN IO port C clock enable **/
#define RCC_AHB2ENR_GPIOCEN		(1 << 2)
/** RCC_AHB2ENR_GPIOBEN IO port B clock enable **/
#define RCC_AHB2ENR_GPIOBEN		(1 << 1)
/** RCC_AHB2ENR_GPIOAEN IO port A clock enable **/
#define RCC_AHB2ENR_GPIOAEN		(1 << 0)

/**@}*/

/** @defgroup rcc_ahb3enr AHB3ENR AHB3 peripheral clock enable register
@{*/

/** RCC_AHB3ENR_QSPIEN QSPIEN **/
#define RCC_AHB3ENR_QSPIEN		(1 << 8)
/** RCC_AHB3ENR_FMCEN Flexible memory controller clock enable **/
#define RCC_AHB3ENR_FMCEN		(1 << 0)

/**@}*/

/** @defgroup rcc_apb1enr1 APB1ENR1 APB1ENR1
@{*/

/** RCC_APB1ENR1_LPTIM1EN Low power timer 1 clock enable **/
#define RCC_APB1ENR1_LPTIM1EN		(1 << 31)
/** RCC_APB1ENR1_OPAMPEN OPAMP interface clock enable **/
#define RCC_APB1ENR1_OPAMPEN		(1 << 30)
/** RCC_APB1ENR1_DAC1EN DAC1 interface clock enable **/
#define RCC_APB1ENR1_DAC1EN		(1 << 29)
/** RCC_APB1ENR1_PWREN Power interface clock enable **/
#define RCC_APB1ENR1_PWREN		(1 << 28)
/** RCC_APB1ENR1_CAN2EN CAN2 clock enable **/
#define RCC_APB1ENR1_CAN2EN		(1 << 26)
/** RCC_APB1ENR1_CAN1EN CAN1 clock enable **/
#define RCC_APB1ENR1_CAN1EN		(1 << 25)
/** RCC_APB1ENR1_CRSEN Clock Recovery System clock enable **/
#define RCC_APB1ENR1_CRSEN		(1 << 24)
/** RCC_APB1ENR1_I2C3EN I2C3 clock enable **/
#define RCC_APB1ENR1_I2C3EN		(1 << 23)
/** RCC_APB1ENR1_I2C2EN I2C2 clock enable **/
#define RCC_APB1ENR1_I2C2EN		(1 << 22)
/** RCC_APB1ENR1_I2C1EN I2C1 clock enable **/
#define RCC_APB1ENR1_I2C1EN		(1 << 21)
/** RCC_APB1ENR1_UART5EN UART5 clock enable **/
#define RCC_APB1ENR1_UART5EN		(1 << 20)
/** RCC_APB1ENR1_UART4EN UART4 clock enable **/
#define RCC_APB1ENR1_UART4EN		(1 << 19)
/** RCC_APB1ENR1_USART3EN USART3 clock enable **/
#define RCC_APB1ENR1_USART3EN		(1 << 18)
/** RCC_APB1ENR1_USART2EN USART2 clock enable **/
#define RCC_APB1ENR1_USART2EN		(1 << 17)
/** RCC_APB1ENR1_SP3EN SPI3 clock enable **/
#define RCC_APB1ENR1_SP3EN		(1 << 15)
/** RCC_APB1ENR1_SPI2EN SPI2 clock enable **/
#define RCC_APB1ENR1_SPI2EN		(1 << 14)
/** RCC_APB1ENR1_WWDGEN Window watchdog clock enable **/
#define RCC_APB1ENR1_WWDGEN		(1 << 11)
/** RCC_APB1ENR1_RTCAPBEN RTC APB clock enable **/
#define RCC_APB1ENR1_RTCAPBEN		(1 << 10)
/** RCC_APB1ENR1_LCDEN LCD clock enable **/
#define RCC_APB1ENR1_LCDEN		(1 << 9)
/** RCC_APB1ENR1_TIM7EN TIM7 timer clock enable **/
#define RCC_APB1ENR1_TIM7EN		(1 << 5)
/** RCC_APB1ENR1_TIM6EN TIM6 timer clock enable **/
#define RCC_APB1ENR1_TIM6EN		(1 << 4)
/** RCC_APB1ENR1_TIM5EN TIM5 timer clock enable **/
#define RCC_APB1ENR1_TIM5EN		(1 << 3)
/** RCC_APB1ENR1_TIM4EN TIM4 timer clock enable **/
#define RCC_APB1ENR1_TIM4EN		(1 << 2)
/** RCC_APB1ENR1_TIM3EN TIM3 timer clock enable **/
#define RCC_APB1ENR1_TIM3EN		(1 << 1)
/** RCC_APB1ENR1_TIM2EN TIM2 timer clock enable **/
#define RCC_APB1ENR1_TIM2EN		(1 << 0)

/**@}*/

/** @defgroup rcc_apb1enr2 APB1ENR2 APB1 peripheral clock enable register 2
@{*/

/** RCC_APB1ENR2_LPTIM2EN LPTIM2EN **/
#define RCC_APB1ENR2_LPTIM2EN		(1 << 5)
/** RCC_APB1ENR2_SWPMI1EN Single wire protocol clock enable **/
#define RCC_APB1ENR2_SWPMI1EN		(1 << 2)
/** RCC_APB1ENR2_I2C4EN I2C4 clock enable **/
#define RCC_APB1ENR2_I2C4EN		(1 << 1)
/** RCC_APB1ENR2_LPUART1EN Low power UART 1 clock enable **/
#define RCC_APB1ENR2_LPUART1EN		(1 << 0)

/**@}*/

/** @defgroup rcc_apb2enr APB2ENR APB2ENR
@{*/

/** RCC_APB2ENR_DFSDMEN DFSDM timer clock enable **/
#define RCC_APB2ENR_DFSDMEN		(1 << 24)
/** RCC_APB2ENR_SAI2EN SAI2 clock enable **/
#define RCC_APB2ENR_SAI2EN		(1 << 22)
/** RCC_APB2ENR_SAI1EN SAI1 clock enable **/
#define RCC_APB2ENR_SAI1EN		(1 << 21)
/** RCC_APB2ENR_TIM17EN TIM17 timer clock enable **/
#define RCC_APB2ENR_TIM17EN		(1 << 18)
/** RCC_APB2ENR_TIM16EN TIM16 timer clock enable **/
#define RCC_APB2ENR_TIM16EN		(1 << 17)
/** RCC_APB2ENR_TIM15EN TIM15 timer clock enable **/
#define RCC_APB2ENR_TIM15EN		(1 << 16)
/** RCC_APB2ENR_USART1EN USART1clock enable **/
#define RCC_APB2ENR_USART1EN		(1 << 14)
/** RCC_APB2ENR_TIM8EN TIM8 timer clock enable **/
#define RCC_APB2ENR_TIM8EN		(1 << 13)
/** RCC_APB2ENR_SPI1EN SPI1 clock enable **/
#define RCC_APB2ENR_SPI1EN		(1 << 12)
/** RCC_APB2ENR_TIM1EN TIM1 timer clock enable **/
#define RCC_APB2ENR_TIM1EN		(1 << 11)
/** RCC_APB2ENR_SDMMCEN SDMMC clock enable **/
#define RCC_APB2ENR_SDMMCEN		(1 << 10)
/** RCC_APB2ENR_FIREWALLEN Firewall clock enable **/
#define RCC_APB2ENR_FIREWALLEN		(1 << 7)
/** RCC_APB2ENR_SYSCFGEN SYSCFG clock enable **/
#define RCC_APB2ENR_SYSCFGEN		(1 << 0)

/**@}*/

/** @defgroup rcc_ahb1smenr AHB1SMENR AHB1 peripheral clocks enable in Sleep and Stop modes register
@{*/

/** RCC_AHB1SMENR_DMA2DSMEN DMA2D clock enable during Sleep and Stop modes **/
#define RCC_AHB1SMENR_DMA2DSMEN		(1 << 17)
/** RCC_AHB1SMENR_TSCSMEN Touch Sensing Controller clocks enable during Sleep and Stop modes **/
#define RCC_AHB1SMENR_TSCSMEN		(1 << 16)
/** RCC_AHB1SMENR_CRCSMEN CRCSMEN **/
#define RCC_AHB1SMENR_CRCSMEN		(1 << 12)
/** RCC_AHB1SMENR_SRAM1SMEN SRAM1 interface clocks enable during Sleep and Stop modes **/
#define RCC_AHB1SMENR_SRAM1SMEN		(1 << 9)
/** RCC_AHB1SMENR_FLASHSMEN Flash memory interface clocks enable during Sleep and Stop modes **/
#define RCC_AHB1SMENR_FLASHSMEN		(1 << 8)
/** RCC_AHB1SMENR_DMA2SMEN DMA2 clocks enable during Sleep and Stop modes **/
#define RCC_AHB1SMENR_DMA2SMEN		(1 << 1)
/** RCC_AHB1SMENR_DMA1SMEN DMA1 clocks enable during Sleep and Stop modes **/
#define RCC_AHB1SMENR_DMA1SMEN		(1 << 0)

/**@}*/

/** @defgroup rcc_ahb2smenr AHB2SMENR AHB2 peripheral clocks enable in Sleep and Stop modes register
@{*/

/** RCC_AHB2SMENR_RNGSMEN Random Number Generator clocks enable during Sleep and Stop modes **/
#define RCC_AHB2SMENR_RNGSMEN		(1 << 18)
/** RCC_AHB2SMENR_HASH1SMEN HASH clock enable during Sleep and Stop modes **/
#define RCC_AHB2SMENR_HASH1SMEN		(1 << 17)
/** RCC_AHB2SMENR_AESSMEN AES accelerator clocks enable during Sleep and Stop modes **/
#define RCC_AHB2SMENR_AESSMEN		(1 << 16)
/** RCC_AHB2SMENR_DCMISMEN DCMI clock enable during Sleep and Stop modes **/
#define RCC_AHB2SMENR_DCMISMEN		(1 << 14)
/** RCC_AHB2SMENR_ADCFSSMEN ADC clocks enable during Sleep and Stop modes **/
#define RCC_AHB2SMENR_ADCFSSMEN		(1 << 13)
/** RCC_AHB2SMENR_OTGFSSMEN OTG full speed clocks enable during Sleep and Stop modes **/
#define RCC_AHB2SMENR_OTGFSSMEN		(1 << 12)
/** RCC_AHB2SMENR_SRAM2SMEN SRAM2 interface clocks enable during Sleep and Stop modes **/
#define RCC_AHB2SMENR_SRAM2SMEN		(1 << 9)
/** RCC_AHB2SMENR_GPIOISMEN IO port I clocks enable during Sleep and Stop modes **/
#define RCC_AHB2SMENR_GPIOISMEN		(1 << 8)
/** RCC_AHB2SMENR_GPIOHSMEN IO port H clocks enable during Sleep and Stop modes **/
#define RCC_AHB2SMENR_GPIOHSMEN		(1 << 7)
/** RCC_AHB2SMENR_GPIOGSMEN IO port G clocks enable during Sleep and Stop modes **/
#define RCC_AHB2SMENR_GPIOGSMEN		(1 << 6)
/** RCC_AHB2SMENR_GPIOFSMEN IO port F clocks enable during Sleep and Stop modes **/
#define RCC_AHB2SMENR_GPIOFSMEN		(1 << 5)
/** RCC_AHB2SMENR_GPIOESMEN IO port E clocks enable during Sleep and Stop modes **/
#define RCC_AHB2SMENR_GPIOESMEN		(1 << 4)
/** RCC_AHB2SMENR_GPIODSMEN IO port D clocks enable during Sleep and Stop modes **/
#define RCC_AHB2SMENR_GPIODSMEN		(1 << 3)
/** RCC_AHB2SMENR_GPIOCSMEN IO port C clocks enable during Sleep and Stop modes **/
#define RCC_AHB2SMENR_GPIOCSMEN		(1 << 2)
/** RCC_AHB2SMENR_GPIOBSMEN IO port B clocks enable during Sleep and Stop modes **/
#define RCC_AHB2SMENR_GPIOBSMEN		(1 << 1)
/** RCC_AHB2SMENR_GPIOASMEN IO port A clocks enable during Sleep and Stop modes **/
#define RCC_AHB2SMENR_GPIOASMEN		(1 << 0)

/**@}*/

/** @defgroup rcc_ahb3smenr AHB3SMENR AHB3 peripheral clocks enable in Sleep and Stop modes register
@{*/

/** RCC_AHB3SMENR_QSPISMEN QSPISMEN **/
#define RCC_AHB3SMENR_QSPISMEN		(1 << 8)
/** RCC_AHB3SMENR_FMCSMEN Flexible memory controller clocks enable during Sleep and Stop modes **/
#define RCC_AHB3SMENR_FMCSMEN		(1 << 0)

/**@}*/

