grevaillot/svd_tools/headers/STM32L4x6/rcc.h
/** @defgroup rcc_apb1smenr1 APB1SMENR1 APB1SMENR1
@{*/

/** RCC_APB1SMENR1_LPTIM1SMEN Low power timer 1 clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_LPTIM1SMEN		(1 << 31)
/** RCC_APB1SMENR1_OPAMPSMEN OPAMP interface clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_OPAMPSMEN		(1 << 30)
/** RCC_APB1SMENR1_DAC1SMEN DAC1 interface clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_DAC1SMEN		(1 << 29)
/** RCC_APB1SMENR1_PWRSMEN Power interface clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_PWRSMEN		(1 << 28)
/** RCC_APB1SMENR1_CAN2SMEN CAN2 clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_CAN2SMEN		(1 << 26)
/** RCC_APB1SMENR1_CAN1SMEN CAN1 clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_CAN1SMEN		(1 << 25)
/** RCC_APB1SMENR1_I2C3SMEN I2C3 clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_I2C3SMEN		(1 << 23)
/** RCC_APB1SMENR1_I2C2SMEN I2C2 clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_I2C2SMEN		(1 << 22)
/** RCC_APB1SMENR1_I2C1SMEN I2C1 clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_I2C1SMEN		(1 << 21)
/** RCC_APB1SMENR1_UART5SMEN UART5 clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_UART5SMEN		(1 << 20)
/** RCC_APB1SMENR1_UART4SMEN UART4 clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_UART4SMEN		(1 << 19)
/** RCC_APB1SMENR1_USART3SMEN USART3 clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_USART3SMEN		(1 << 18)
/** RCC_APB1SMENR1_USART2SMEN USART2 clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_USART2SMEN		(1 << 17)
/** RCC_APB1SMENR1_SP3SMEN SPI3 clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_SP3SMEN		(1 << 15)
/** RCC_APB1SMENR1_SPI2SMEN SPI2 clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_SPI2SMEN		(1 << 14)
/** RCC_APB1SMENR1_WWDGSMEN Window watchdog clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_WWDGSMEN		(1 << 11)
/** RCC_APB1SMENR1_RTCAPBSMEN RTC APB clock enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_RTCAPBSMEN		(1 << 10)
/** RCC_APB1SMENR1_LCDSMEN LCD clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_LCDSMEN		(1 << 9)
/** RCC_APB1SMENR1_TIM7SMEN TIM7 timer clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_TIM7SMEN		(1 << 5)
/** RCC_APB1SMENR1_TIM6SMEN TIM6 timer clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_TIM6SMEN		(1 << 4)
/** RCC_APB1SMENR1_TIM5SMEN TIM5 timer clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_TIM5SMEN		(1 << 3)
/** RCC_APB1SMENR1_TIM4SMEN TIM4 timer clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_TIM4SMEN		(1 << 2)
/** RCC_APB1SMENR1_TIM3SMEN TIM3 timer clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_TIM3SMEN		(1 << 1)
/** RCC_APB1SMENR1_TIM2SMEN TIM2 timer clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR1_TIM2SMEN		(1 << 0)

/**@}*/

/** @defgroup rcc_apb1smenr2 APB1SMENR2 APB1 peripheral clocks enable in Sleep and Stop modes register 2
@{*/

/** RCC_APB1SMENR2_LPTIM2SMEN LPTIM2SMEN **/
#define RCC_APB1SMENR2_LPTIM2SMEN		(1 << 5)
/** RCC_APB1SMENR2_SWPMI1SMEN Single wire protocol clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR2_SWPMI1SMEN		(1 << 2)
/** RCC_APB1SMENR2_I2C4SMEN I2C4 clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR2_I2C4SMEN		(1 << 1)
/** RCC_APB1SMENR2_LPUART1SMEN Low power UART 1 clocks enable during Sleep and Stop modes **/
#define RCC_APB1SMENR2_LPUART1SMEN		(1 << 0)

/**@}*/

/** @defgroup rcc_apb2smenr APB2SMENR APB2SMENR
@{*/

/** RCC_APB2SMENR_DFSDMSMEN DFSDM timer clocks enable during Sleep and Stop modes **/
#define RCC_APB2SMENR_DFSDMSMEN		(1 << 24)
/** RCC_APB2SMENR_SAI2SMEN SAI2 clocks enable during Sleep and Stop modes **/
#define RCC_APB2SMENR_SAI2SMEN		(1 << 22)
/** RCC_APB2SMENR_SAI1SMEN SAI1 clocks enable during Sleep and Stop modes **/
#define RCC_APB2SMENR_SAI1SMEN		(1 << 21)
/** RCC_APB2SMENR_TIM17SMEN TIM17 timer clocks enable during Sleep and Stop modes **/
#define RCC_APB2SMENR_TIM17SMEN		(1 << 18)
/** RCC_APB2SMENR_TIM16SMEN TIM16 timer clocks enable during Sleep and Stop modes **/
#define RCC_APB2SMENR_TIM16SMEN		(1 << 17)
/** RCC_APB2SMENR_TIM15SMEN TIM15 timer clocks enable during Sleep and Stop modes **/
#define RCC_APB2SMENR_TIM15SMEN		(1 << 16)
/** RCC_APB2SMENR_USART1SMEN USART1clocks enable during Sleep and Stop modes **/
#define RCC_APB2SMENR_USART1SMEN		(1 << 14)
/** RCC_APB2SMENR_TIM8SMEN TIM8 timer clocks enable during Sleep and Stop modes **/
#define RCC_APB2SMENR_TIM8SMEN		(1 << 13)
/** RCC_APB2SMENR_SPI1SMEN SPI1 clocks enable during Sleep and Stop modes **/
#define RCC_APB2SMENR_SPI1SMEN		(1 << 12)
/** RCC_APB2SMENR_TIM1SMEN TIM1 timer clocks enable during Sleep and Stop modes **/
#define RCC_APB2SMENR_TIM1SMEN		(1 << 11)
/** RCC_APB2SMENR_SDMMCSMEN SDMMC clocks enable during Sleep and Stop modes **/
#define RCC_APB2SMENR_SDMMCSMEN		(1 << 10)
/** RCC_APB2SMENR_SYSCFGSMEN SYSCFG clocks enable during Sleep and Stop modes **/
#define RCC_APB2SMENR_SYSCFGSMEN		(1 << 0)

/**@}*/

/** @defgroup rcc_ccipr CCIPR CCIPR
@{*/

/** RCC_CCIPR_DFSDMSEL DFSDM clock source selection **/
#define RCC_CCIPR_DFSDMSEL		(1 << 31)
/** RCC_CCIPR_SWPMI1SEL SWPMI1 clock source selection **/
#define RCC_CCIPR_SWPMI1SEL		(1 << 30)

#define RCC_CCIPR_ADCSEL_SHIFT		28
#define RCC_CCIPR_ADCSEL_MASK		0x03
/** @defgroup rcc_ccipr_adcsel ADCSEL ADCs clock source selection
@{*/
/**@}*/


#define RCC_CCIPR_CLK48SEL_SHIFT		26
#define RCC_CCIPR_CLK48SEL_MASK		0x03
/** @defgroup rcc_ccipr_clk48sel CLK48SEL 48 MHz clock source selection
@{*/
/**@}*/


#define RCC_CCIPR_SAI2SEL_SHIFT		24
#define RCC_CCIPR_SAI2SEL_MASK		0x03
/** @defgroup rcc_ccipr_sai2sel SAI2SEL SAI2 clock source selection
@{*/
/**@}*/


#define RCC_CCIPR_SAI1SEL_SHIFT		22
#define RCC_CCIPR_SAI1SEL_MASK		0x03
/** @defgroup rcc_ccipr_sai1sel SAI1SEL SAI1 clock source selection
@{*/
/**@}*/


